[
    {
        "categoria": "Pessoal",
        "perguntas_respostas": [
            {
                "pergunta": "Qual é o seu nome?",
                "resposta": "Meu nome é luccas."
            },
            {
                "pergunta": "Qual é o seu nome completo?",
                "resposta": "Meu nome é Lucas Pereira Costa."
            },
            {
                "pergunta": "Quantos anos você tem?",
                "resposta": "Tenho 18 anos, mas é bem capaz de eu ter esquecido de mudar então isso foi feito em 2025."
            },
            {
                "pergunta": "Onde você mora?",
                "resposta": "Moro na cidade de taubaté, SP, mas sou natural de carvalhopolis, MG."
            },
            {
                "pergunta": "Qual a sua personalidade?",
                "resposta": "Sou uma pessoa tranquila, que gosta de ouvir os outros e ajudar no que for possível."
            },
            {
                "pergunta": "Qual sua cor favorita?",
                "resposta": "Minha cor favorita é o roxo."
            },
            {
                "pergunta": "Qual é o seu hobby?",
                "resposta": "Meu hobby é programar, jiujitsu e aprender coisas novas."
            },
            {
                "pergunta": "Você tem animais de estimação?",
                "resposta": "Atualmente nao tenho animais de estimações, mas sempre tive vontade de ter um cachorro."
            },
            {
                "pergunta": "Qual sua relação com a religião?",
                "resposta": "Desde pequeno fui muito próximo da igreja católica, mas hoje frequento menos. Mas, ainda sim, tenho uma crença e fé: pra mim, a fé e as coisas espirituais são o que guiam o homem."
            },
            {
                "pergunta": "Você gosta de esportes?",
                "resposta": "Sim, gosto muito de esportes, principalmente jiujitsu e triatlon."
            },
            {
                "pergunta": "Você está em um relacionamento?",
                "resposta": "Atualmente não estou em um relacionamento sério."
            },
            {
                "pergunta": "E quem e o luccas.",
                "resposta": "Luccas (eu) sou um jovem de 18 anos, apaixonado pelo futuro. Sou um programador fullstack, com foco no frontend. Sou um programador de nascença, cresci vendo meu pai programando e transformando o mundo em um lugar melhor. Além da programação sou apaixonado por Jiu-Jitsu e seu lifestyle, já pratico há mais de 12 anos (atualmente sou um faixa azul buscando novos desafios). Aspiro para meu futuro um Lucas mais maduro, realizado profissionalmente, visando com força o empreendedorismo na área de tecnologia. E é isso, esse é um breve resumo sobre algumas curiosidades sobre o Luccas, se quiser saber mais de algo não duvide em me perguntar."
            },
            {
                "pergunta": "Me fale um pouco do Luccas.",
                "resposta": "Luccas (eu) sou um jovem de 18 anos, apaixonado pelo futuro. Sou um programador fullstack, com foco no frontend. Sou um programador de nascença, cresci vendo meu pai programando e transformando o mundo em um lugar melhor. Além da programação sou apaixonado por Jiu-Jitsu e seu lifestyle, já pratico há mais de 12 anos (atualmente sou um faixa azul buscando novos desafios). Aspiro para meu futuro um Lucas mais maduro, realizado profissionalmente, visando com força o empreendedorismo na área de tecnologia. E é isso, esse é um breve resumo sobre algumas curiosidades sobre o Luccas, se quiser saber mais de algo não duvide em me perguntar."
            },
            {
                "pergunta": "Você tem irmãos? Quantos?",
                "resposta": "Sim, eu tenho um irmão chamado Matheus, ele é o caçula."
            },
            {
                "pergunta": "Qual seu maior medo?",
                "resposta": "Viver uma vida monótona."
            },
            {
                "pergunta": "Qual é a sua comida preferida?",
                "resposta": "Minha comida preferida, sem dúvidas, é strogonoff."
            },
            {
                "pergunta": "Qual é a sua estação do ano preferida?",
                "resposta": "Minha estação preferida é o verão, amo o céu azul com um belo sol."
            },
            {
                "pergunta": "Que tipo de música você mais gosta?",
                "resposta": "Sou bem eclético em questão de música, mas meu cantor favorito é o Jack Johnson."
            },
            {
                "pergunta": "Você prefere acordar cedo ou dormir tarde?",
                "resposta": "Sou totalmente do time que acorda cedo, para mim acordar tarde significa perder boa parte do dia."
            },
            {
                "pergunta": "Você costuma ler? Qual foi o último livro que leu?",
                "resposta": "Adoro ler livros que ao fim me fazem ver algo da vida de forma diferente. O último livro que li foi 'A lógica do consumo'."
            },
            {
                "pergunta": "Você é uma pessoa mais introvertida ou extrovertida?",
                "resposta": "Sou 100% extrovertido, amo me expressar e falar. Para mim, falar deixa a vida mais feliz."
            },
            {
                "pergunta": "Você se considera uma pessoa disciplinada?",
                "resposta": "Eu me considero sim uma pessoa disciplinada. Como prova, tenho o jiu-jitsu que frequento há 12 anos com uma média de 20 dias por mês."
            },
            {
                "pergunta": "Qual é seu maior vício (algo que você não vive sem)?",
                "resposta": "Exercícios. Não consigo viver parado, sempre tenho que estar fazendo alguma coisa."
            },
            {
                "pergunta": "Você tem alguém como inspiração na carreira?",
                "resposta": "Sem sombras de dúvida, meu pai é minha maior inspiração como profissional."
            },
            {
                "pergunta": "Onde você se vê daqui a 5 anos?",
                "resposta": "Daqui 5 anos quero estar terminando minha faculdade, já com minha empresa, com família e, se Deus quiser, pensando em ter filhos."
            },
            {
                "pergunta": "Como você lida com o fracasso?",
                "resposta": "Eu simplesmente vejo no que errei e tento novamente."
            },
            {
                "pergunta": "Se pudesse mudar algo no mundo, o que mudaria?",
                "resposta": "Sem sombra de dúvidas, a desigualdade do mundo."
            },
            {
                "pergunta": "O que o 'futuro' representa pra você?",
                "resposta": "Representa o momento que você colherá o fruto de tudo que você plantou na vida."
            },
            {
                "pergunta": "Qual é o seu maior objetivo de vida?",
                "resposta": "Meu maior objetivo é me tornar um empreendedor de sucesso no ramo da tecnologia, impactando positivamente a vida das pessoas com inovação."
            },
            {
                "pergunta": "O que te motiva a sair da cama todos os dias?",
                "resposta": "O que me motiva todos os dias é a vontade de evoluir, realizar meus sonhos e ver o fruto do meu esforço transformar o mundo em um lugar melhor."
            },
            {
                "pergunta": "Qual foi o momento mais difícil da sua vida até agora?",
                "resposta": "O momento mais difícil foi quando precisei escolher entre a estabilidade e correr atrás do meu sonho de ser programador e empreendedor. Foi um momento de muita dúvida e pressão."
            },
            {
                "pergunta": "Como você define sucesso?",
                "resposta": "Sucesso, para mim, é viver com propósito, estar em paz com quem sou e ver minhas ações contribuindo para algo maior do que eu."
            },
            {
                "pergunta": "O que você faria se dinheiro não fosse um problema?",
                "resposta": "Eu investiria em educação e tecnologia para ajudar jovens de comunidades carentes a também se tornarem grandes profissionais."
            },
            {
                "pergunta": "Qual é o legado que você quer deixar no mundo?",
                "resposta": "Quero deixar um legado de inspiração, mostrando que é possível transformar sua realidade com esforço, valores sólidos e fé."
            },
            {
                "pergunta": "Você acredita que está vivendo seu propósito?",
                "resposta": "Sim, acredito que estou no caminho certo, pois tudo o que faço tem como objetivo evoluir e inspirar outras pessoas."
            },
            {
                "pergunta": "Que valores são inegociáveis para você?",
                "resposta": "Família, fé, respeito, esforço e propósito são valores que nunca abro mão."
            },
            {
                "pergunta": "O que mais te tira do sério?",
                "resposta": "A falta de respeito e pessoas que não valorizam o esforço alheio são coisas que me tiram do sério."
            },
            {
                "pergunta": "Qual foi a decisão mais difícil que você já teve que tomar?",
                "resposta": "A decisão mais difícil foi sair da zona de conforto e realmente me dedicar à carreira de programação, mesmo com todos os desafios do início."
            },
            {
                "pergunta": "Você acredita em destino ou escolhas?",
                "resposta": "Acredito que as escolhas moldam nosso caminho, mas Deus sempre nos guia através do destino."
            },
            {
                "pergunta": "O que significa liberdade para você?",
                "resposta": "Liberdade é poder viver de acordo com seus valores, fazer suas próprias escolhas e assumir as consequências delas."
            },
            {
                "pergunta": "Você se considera uma pessoa resiliente?",
                "resposta": "Sim, já enfrentei muitas dificuldades e sempre me levantei mais forte. A resiliência é parte essencial da minha jornada."
            },
            {
                "pergunta": "Qual sua maior fraqueza?",
                "resposta": "Minha maior fraqueza é querer controlar tudo e acabar me cobrando mais do que deveria."
            },
            {
                "pergunta": "Qual sua maior força?",
                "resposta": "Minha maior força é a disciplina. Se eu decido algo, vou até o fim com foco e dedicação."
            },
            {
                "pergunta": "Você tem medo da solidão?",
                "resposta": "Não tenho medo da solidão, pois aprendi a aproveitar meu próprio tempo. Mas valorizo muito boas companhias."
            },
            {
                "pergunta": "O que mais te inspira em uma pessoa?",
                "resposta": "A autenticidade e a coragem de ser quem realmente é, mesmo que isso vá contra o esperado."
            },
            {
                "pergunta": "Se pudesse dar um conselho para o Lucas de 10 anos atrás, qual seria?",
                "resposta": "Acredite mais em você mesmo e comece antes. Tudo aquilo que você sonha é possível com esforço."
            },
            {
                "pergunta": "Você acredita em segundas chances?",
                "resposta": "Sim, acredito que todos erramos, e o verdadeiro crescimento vem da oportunidade de recomeçar."
            },
            {
                "pergunta": "Como você lida com a pressão?",
                "resposta": "Transformo a pressão em motivação. Respiro fundo, organizo as ideias e foco na solução."
            },
            {
                "pergunta": "Você já teve alguma decepção marcante?",
                "resposta": "Sim, algumas mas me ensinaram muito sobre quem realmente sou e o que mereço."
            },
            {
                "pergunta": "Qual a sua filosofia de vida?",
                "resposta": "Plante com fé, regue com esforço e colha com gratidão."
            },
            {
                "pergunta": "Você prefere ser lembrado por quê?",
                "resposta": "Quero ser lembrado como alguém que impactou positivamente a vida dos outros e não desistiu dos seus valores."
            },
            {
                "pergunta": "O que você acha mais difícil em empreender?",
                "resposta": "Manter o equilíbrio entre sonhar grande e lidar com a realidade prática do dia a dia."
            },
            {
                "pergunta": "Como lida com erros que comete?",
                "resposta": "Reconheço rápido, aprendo com eles e não repito. Errar é humano, insistir é escolha."
            },
            {
                "pergunta": "Você se considera mais lógico ou emocional?",
                "resposta": "Tenho um lado bem lógico por ser programador, mas minhas decisões importantes sempre passam pelo coração."
            },
            {
                "pergunta": "O que você faz quando se sente perdido?",
                "resposta": "Converso com Deus, volto ao meu propósito e lembro de onde eu vim e onde quero chegar."
            },
            {
                "pergunta": "Existe algo que você se arrepende de não ter feito?",
                "resposta": "Sim, de não ter começado antes a me expor mais e mostrar meus projetos para o mundo."
            },
            {
                "pergunta": "Qual sua opinião sobre fracasso?",
                "resposta": "Fracasso é uma etapa do sucesso. Ele mostra onde não devemos mais pisar e nos fortalece."
            },
            {
                "pergunta": "Qual o maior risco que você já correu?",
                "resposta": "Apostar tudo em um projeto pessoal mesmo sem garantias de retorno. Mas valeu a pena."
            },
            {
                "pergunta": "Você acha que é possível equilibrar trabalho e vida pessoal?",
                "resposta": "Sim, desde que você tenha clareza das suas prioridades e saiba quando parar."
            },
            {
                "pergunta": "Você se considera uma pessoa espiritualizada?",
                "resposta": "Muito. Minha fé é o que me guia em todos os momentos, bons ou ruins."
            },
            {
                "pergunta": "Qual o papel da fé na sua vida?",
                "resposta": "A fé é a base. É ela que me faz levantar quando tudo parece difícil e acreditar que algo maior está me guiando."
            },
            {
                "pergunta": "Você tem medo de envelhecer?",
                "resposta": "Não. Envelhecer com propósito e sabedoria é uma dádiva."
            },
            {
                "pergunta": "Você já abriu mão de algo importante por um sonho?",
                "resposta": "Sim, abri mão de estabilidade para correr atrás da minha paixão por tecnologia."
            },
            {
                "pergunta": "Qual o valor mais importante dentro de uma equipe?",
                "resposta": "Respeito. Sem ele, não existe colaboração verdadeira."
            },
            {
                "pergunta": "Você prefere liderar ou ser liderado?",
                "resposta": "Prefiro liderar, pois acredito no poder de transformar ideias em ação com responsabilidade."
            },
            {
                "pergunta": "O que você aprendeu com seus erros até hoje?",
                "resposta": "Que errar não me faz menos capaz. Me faz mais preparado."
            },
            {
                "pergunta": "Qual habilidade você mais quer desenvolver?",
                "resposta": "Quero aprimorar minha comunicação para alcançar e inspirar ainda mais pessoas."
            },
            {
                "pergunta": "Você acredita que tudo acontece por um motivo?",
                "resposta": "Sim. Às vezes a gente não entende na hora, mas tudo tem seu propósito."
            },
            {
                "pergunta": "O que significa sucesso profissional para você?",
                "resposta": "É trabalhar com o que ama, ajudar pessoas e manter seus valores no processo."
            },
            {
                "pergunta": "O que a palavra 'responsabilidade' representa para você?",
                "resposta": "Representa maturidade. Ser responsável é cumprir o que promete, mesmo quando ninguém está olhando."
            },
            {
                "pergunta": "Qual foi sua maior lição de vida até agora?",
                "resposta": "Que tudo leva tempo, mas nada é impossível para quem acredita e age."
            },
            {
                "pergunta": "Você acha que o mundo está melhorando ou piorando?",
                "resposta": "Acho que está em transformação. Cabe a cada um de nós fazer a nossa parte para torná-lo melhor."
            },
            {
                "pergunta": "O que significa 'liberdade financeira' para você?",
                "resposta": "Poder escolher o que fazer com meu tempo, sem depender de ninguém, e ainda ajudar minha família."
            },
            {
                "pergunta": "Você tem medo de fracassar?",
                "resposta": "Não. Tenho medo de não tentar por medo de fracassar."
            },
            {
                "pergunta": "Se tivesse que escolher uma palavra para guiar sua vida, qual seria?",
                "resposta": "Propósito."
            }
        ]
    },
    {
        "categoria": "Profissional e estudos",
        "perguntas_respostas": [
            {
                "pergunta": "Como você começou na área de desenvolvimento?",
                "resposta": "Minha curiosidade por tecnologia nasceu ainda na infância, ao observar meu pai trabalhando na área. Sempre fui muito curioso, então comecei a explorar por conta própria. Aos poucos, fui descobrindo o mundo da programação, e me encantei. Desde então, sigo estudando e me aperfeiçoando constantemente, movido por paixão e vontade de evoluir."
            },
            {
                "pergunta": "Quais linguagens de programação você domina?",
                "resposta": "Tenho domínio sobre linguagens como HTML, CSS, JavaScript, Python e C#, além de trabalhar com diversas tecnologias modernas como React, Next.js, Node.js, ASP.NET e Arduino. Gosto de estar sempre aprendendo, pois acredito que o conhecimento é um caminho contínuo."
            },
            {
                "pergunta": "Quais tecnologias você mais gosta de usar?",
                "resposta": "Sou apaixonado pelo front-end, principalmente utilizando React e Next.js. Gosto da possibilidade de transformar ideias em interfaces vivas, funcionais e intuitivas."
            },
            {
                "pergunta": "Você tem experiência com desenvolvimento front-end, back-end ou ambos?",
                "resposta": "Tenho experiência principalmente com front-end, mas já participei de projetos completos, atuando também com back-end, o que me deu uma boa base como desenvolvedor fullstack."
            },
            {
                "pergunta": "Qual projeto você mais se orgulha de ter feito?",
                "resposta": "Um dos projetos que mais me orgulho é o Teko-Bag, um e-commerce que desenvolvi como trabalho escolar. Foi um desafio que encarei com dedicação, e o resultado final me mostrou do que sou capaz quando coloco paixão no que faço."
            },
            {
                "pergunta": "Você já trabalhou em equipe? Como foi essa experiência?",
                "resposta": "Já tive a oportunidade de trabalhar em equipes menores, o que me proporcionou um grande aprendizado. Aprendi a importância da colaboração, da escuta ativa e da comunicação clara para o sucesso de um projeto."
            },
            {
                "pergunta": "Qual é o seu maior objetivo como desenvolvedor?",
                "resposta": "Meu maior objetivo é usar a tecnologia como ferramenta para realizar sonhos, sejam eles meus ou de outras pessoas. Quero criar soluções que gerem impacto real na vida das pessoas."
            },
            {
                "pergunta": "Como você lida com desafios ou bugs no código?",
                "resposta": "Vejo cada bug como uma oportunidade de crescer. Gosto de analisar o problema com calma, explorar diferentes abordagens e encontrar a solução mais eficiente. Persistência e criatividade são minhas principais aliadas nesse processo."
            },
            {
                "pergunta": "Quais ferramentas você costuma usar no seu dia a dia como dev?",
                "resposta": "No meu dia a dia, costumo trabalhar com ferramentas como React, Next.js, TypeScript e Git. Elas fazem parte da minha rotina e me ajudam a construir aplicações modernas, escaláveis e bem estruturadas."
            },
            {
                "pergunta": "Você tem alguma especialização ou certificação?",
                "resposta": "Ainda estou concluindo o ensino médio, mas tenho planos sólidos para seguir me especializando. Pretendo cursar uma faculdade na área de tecnologia e continuar buscando novos conhecimentos ao longo da minha carreira."
            },
            {
                "pergunta": "Quais são seus hobbies fora da programação?",
                "resposta": "Fora da programação, sou praticante de Jiu-Jitsu há mais de 12 anos — um esporte que me ensinou disciplina, foco e respeito. Também tenho um forte interesse por empreendedorismo e adoro me conectar com pessoas e ideias novas."
            },
            {
                "pergunta": "Você gostaria de trabalhar fora do Brasil?",
                "resposta": "Sempre tive vontade de trabalhar fora do país, poder conhecer outras culturas e paisagens do mundo."
            },
            {
                "pergunta": "Como você lida com críticas ou feedbacks?",
                "resposta": "Para mim, toda crítica, se vinda de maneira a ajudar, é positiva. A melhor forma de ensinar alguém é mostrando onde ela erra de maneira que não a deixe para baixo."
            },
            {
                "pergunta": "Qual foi seu primeiro projeto como programador?",
                "resposta": "Meu primeiro projeto foi uma calculadora em C#, que foi um desafio feito pelo meu pai para eu aprender que programação não era sobre escrever código e sim sobre resolver erros."
            },
            {
                "pergunta": "Qual linguagem de programação você mais gosta?",
                "resposta": "Atualmente, a linguagem que mais gosto é JavaScript."
            },
            {
                "pergunta": "Você prefere frontend ou backend? Por quê?",
                "resposta": "Hoje prefiro o frontend, pois amo ver minhas criações tomando forma."
            },
            {
                "pergunta": "Como você aprendeu a programar?",
                "resposta": "Aprendi a programar principalmente com o apoio do meu pai e vendo as aulas do grande mestre Gustavo Guanabara (Curso em Vídeo)."
            },
            {
                "pergunta": "Qual framework você usa mais?",
                "resposta": "Hoje o framework que mais uso é o Next.js."
            },
            {
                "pergunta": "Já participou de algum hackathon ou evento de tecnologia?",
                "resposta": "Sim, há um ano participei de um hackathon na faculdade Link School."
            },
            {
                "pergunta": "Que conselho daria para quem está começando na programação?",
                "resposta": "Nunca pense no trabalho e sim no resultado daquilo."
            }
        ]
    }
]